src/cf/InformationRegisters/РеестрЗаявокНаМедосмотр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РеестрЗаявокНаМедосмотр</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗаявки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайнийСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаключениеМедКомиссии</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеМедицинскойКомиссии</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Просрочена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаМедосмотр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаМедосмотр</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ЗаключениеМедицинскойКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЗаключениеМедицинскойКомиссии</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаМедосмотр</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаМедосмотр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пациент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пациенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДопуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДопусковСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскоеЗаключение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/РегламентМедОсмотры/Ext/Module.bsl
#Область МедОсмотры

Процедура ЗакрытиеНевыполненныхЗаявокНаМедосмотр() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеестрЗаявок.ЗаявкаНаМедосмотр КАК ЗаявкаНаМедосмотр,
	|	РеестрЗаявок.Пациент КАК Пациент
	|ИЗ
	|	РегистрСведений.РеестрЗаявокНаМедосмотр КАК РеестрЗаявок
	|ГДЕ
	|	РеестрЗаявок.Просрочена = ЛОЖЬ
	|	И РеестрЗаявок.ЗаключениеМедКомиссии = ЗНАЧЕНИЕ(Документ.ЗаключениеМедицинскойКомиссии.ПустаяСсылка)
	|	И РеестрЗаявок.КрайнийСрок < &КрайнийСрок";
	
	Запрос.УстановитьПараметр("КрайнийСрок", НачалоДня(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			МЗ = РегистрыСведений.РеестрЗаявокНаМедосмотр.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Выборка);
			МЗ.Прочитать();
			Если МЗ.Выбран() Тогда
				МЗ.Просрочена = Истина;
				МЗ.Записать();
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
